{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "clarity_negative",
    "1": "clarity_positive",
    "2": "meaningful_comparison_negative",
    "3": "meaningful_comparison_positive",
    "4": "motivation_negative",
    "5": "motivation_positive",
    "6": "O",
    "7": "originality_negative",
    "8": "originality_positive",
    "9": "replicability_negative",
    "10": "replicability_positive",
    "11": "soundness_negative",
    "12": "soundness_positive",
    "13": "substance_negative",
    "14": "substance_positive",
    "15": "summary"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "O": 6,
    "clarity_negative": 0,
    "clarity_positive": 1,
    "meaningful_comparison_negative": 2,
    "meaningful_comparison_positive": 3,
    "motivation_negative": 4,
    "motivation_positive": 5,
    "originality_negative": 7,
    "originality_positive": 8,
    "replicability_negative": 9,
    "replicability_positive": 10,
    "soundness_negative": 11,
    "soundness_positive": 12,
    "substance_negative": 13,
    "substance_positive": 14,
    "summary": 15
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "type_vocab_size": 2,
  "vocab_size": 28996
}
